#include <stdio.h> 
int main ()
{
	double c,a;
	printf ("请输入你的月薪\n");
	scanf("%lf",&a);//a为月薪，c为税率
	if (a<=1500){
		c=(a*0.03)-0;
		} 
	else if (1500<=a&&a<4500){
		c=((a-3500)*0.1)-105;
	} 
    else if (4500<=a&&a<9000){
    	c=((a-3500)*0.2)-555;
	} 
    else if (9000<=a&&a<35000){
    	c=((a-3500)*0.25)-1005;
	}
	else if (35000<=a&&a<55000){
		c=((a-3500)*0.30)-2755;
	} 
	else if (55000<=a&&a<80000){
		c=((a-3500)*0.35)-5505;
	}  
	else if (a>80000){
		c=((a-3500)*0.45)-13505;
	} 
	printf ("税费为%lf\n",c);
	return 0;
}
